Теоретичні питання
1. Що таке логічний оператор?
це оператор, який використовується для порівняння значень і повертає логічне значення
2. Які логічні оператори є в JavaScript і які їх символи?
||, &&, if, else




Практичні завдання.
1. Попросіть користувача ввести свій вік за допомогою prompt.

Якщо вік менше 12 років, виведіть у вікні alert повідомлення про те,

що він є дитиною, якщо вік менше 18 років, виведіть повідомлення про те,

що він є підлітком, інакше виведіть повідомлення про те, що він є дорослим.

const userAge = prompt('Введіть свій вік')
if (userAge < 12){
    alert ('ти дитина')
}if else (userAge > 12 || < 18){
    alert (' ти підліток')
} else {
    alert ('ти дорослий')
}