Теоретичні питання
1. Що таке цикл в програмуванні?
це процес, який відбувається n кількість разів для отримання результату
2. Які види циклів є в JavaScript і які їх ключові слова?
for/while
3. Чим відрізняється цикл do while від while?





Практичні завдання
1. Запитайте у користувача два числа. Перевірте, чи є кожне з введених значень числом. Якщо ні, то запитуйте у користувача нове занчення до тих пір, поки воно не буде числом. Виведіть на екран всі числа від меншого до більшого за допомогою циклу for.
let one = prompt('введи число')
while (isNaN(one) || one === null || one === '') {
    one = prompt('Це не число. Введи перше число ще раз:');
}
let two = prompt('введи число')
while (isNaN(two) || two === null || two === '') {
    two = prompt('Це не число. Введи друге число ще раз:');
}

let start = Math.min(one, two);
let end = Math.max(one, two);

for (let i = start; i <= end; i++) {
    console.log(i);
}
2. Напишіть програму, яка запитує в користувача число та перевіряє, чи воно є парним числом. Якщо введене значення не є парним числом, то запитуйте число доки користувач не введе правильне значення.
let number = prompt("введи парне число");
while (
    number === null || number === "" || isNaN(number) || Number(number) % 2 !== 0){
    number = prompt("Це не парне число. Введи парне число ще раз:");
}

alert('Дякую! Ти ввів парне число: ${number}');